Repository: team-hummelt/wp-sync-scss
Catalog: languages/autocompiler-scss-*.po
Languages: es_es, fr_fr

source: Ajax transmission error
es_es: Error de transmisión Ajax
fr_fr: Erreur de transmission Ajax

source: Cache cleared
es_es: Caché borrada
fr_fr: Cache effacé

source: Settings
es_es: Ajustes
fr_fr: Paramètres

source: Donate
es_es: Donar
fr_fr: Faire un don

source: AutoCSS Builder is a powerful WordPress plugin that converts SCSS files to CSS - directly in your admin area. Choose between different map output options (inline, separate file, or no map) to customise your workflow. Ideal for developers who value efficiency and customisability.
es_es: AutoCSS Builder es un potente plugin para WordPress que convierte archivos SCSS a CSS - directamente en tu área de administración. Elija entre diferentes opciones de salida de mapa (en línea, archivo separado o sin mapa) para personalizar su flujo de trabajo. Ideal para desarrolladores que valoran la eficiencia y la personalización.

source: Subscriber
es_es: Abonado
fr_fr: Abonné

source: Employees
es_es: Empleados
fr_fr: Salariés

source: Author
es_es: Autor
fr_fr: Auteur

source: Administrator
es_es: Administrador
fr_fr: Administrateur

source: expanded
es_es: ampliado
fr_fr: élargi

source: compressed
es_es: comprimido
fr_fr: comprimé

source: File
es_es: Archivo
fr_fr: Fichier

source: Inline
es_es: En línea

source: Minimum requirement for using this plugin
es_es: Requisitos mínimos para utilizar este plugin
fr_fr: Exigences minimales pour l'utilisation de ce plugin

source: Plugin Info
es_es: Información del plugin
fr_fr: Info sur le plugin

source: Plugin settings
es_es: Configuración del plugin
fr_fr: Paramètres du plugin

source: Cache active
es_es: Caché activo
fr_fr: Aktiver Cache

source: SCSS Compiler
es_es: Compilador SCSS
fr_fr: Compilateur SCSS

source: Version
es_es: Versión

source: Set up paths
es_es: Establecer rutas
fr_fr: Mettre en place des chemins

source: SCSS / SASS Location
es_es: Ubicación de SCSS / SASS
fr_fr: SCSS / SASS Localisation

source: CSS Location
es_es: CSS Ubicación
fr_fr: Emplacement du SOC

source: SCSS Compiler active
es_es: Compilador SCSS activo
fr_fr: Compilateur SCSS actif

source: Select location
es_es: Seleccione el lugar
fr_fr: Sélectionner un lieu

source: SCSS compiler active
es_es: Compilador SCSS activo
fr_fr: Compilateur SCSS actif

source: Cache Setting
es_es: Configuración de caché
fr_fr: Réglage du cache

source: Output settings
es_es: Ajustes de salida
fr_fr: Paramètres de sortie

source: Create source map
es_es: Crear mapa de fuentes
fr_fr: Créer une carte des sources

source: Create enqueue stylesheets
es_es: Crear hojas de estilo en cola
fr_fr: Créer des feuilles de style enqueue

source: Compiler only active at login
es_es: El compilador sólo está activo al iniciar sesión
fr_fr: Le compilateur n'est actif qu'à l'ouverture de la session

source: CSS stylesheets are automatically added to the header.
es_es: Las hojas de estilo CSS se añaden automáticamente a la cabecera.
fr_fr: Les feuilles de style CSS sont automatiquement ajoutées à l'en-tête.

source: If activated, the SCSS compiler is only active when a user is logged in.
es_es: Si está activado, el compilador SCSS sólo estará activo cuando un usuario esté conectado.
fr_fr: S'il est activé, le compilateur SCSS n'est actif que lorsqu'un utilisateur est connecté.

source: Source Map Optionen
es_es: Mapa de fuentes Opciones
fr_fr: Carte des sources Optionen

source: Select folder
es_es: Seleccionar carpeta
fr_fr: Sélectionner un dossier

source: Folder name
es_es: Nombre de la carpeta
fr_fr: Nom du dossier

source: cancel
es_es: cancelar
fr_fr: annuler

source: Cache path
es_es: Ruta de caché

source: Empty cache
es_es: Vaciar caché
fr_fr: Vider le cache

source: Plugin name
es_es: Nombre del plugin
fr_fr: Nom du plugin

source: Plugin description
es_es: Descripción del plugin

source: AutoCSS Builder is the ideal tool for developers and designers who want to use SCSS in their WordPress projects. This plugin automatically converts SCSS files to CSS and offers flexible map output options, including inline maps, external files or no maps - depending on your needs.
es_es: AutoCSS Builder es la herramienta ideal para desarrolladores y diseñadores que deseen utilizar SCSS en sus proyectos de WordPress. Este plugin convierte automáticamente los archivos SCSS a CSS y ofrece opciones flexibles de salida de mapas, incluyendo mapas en línea, archivos externos o sin mapas - dependiendo de sus necesidades.

source: Features
es_es: Características

source: <span class="fw-semibold">Automatic SCSS compilation:</span> SCSS files are converted directly into CSS.
es_es: <span class="fw-semibold">Compilación automática de SCSS:</span> Los archivos SCSS se convierten directamente en CSS.
fr_fr: <span class="fw-semibold">Compilation SCSS automatique:</span> Les fichiers SCSS sont convertis directement en CSS.

source: <span class="fw-semibold">Flexible map options:</span> Choose between inline maps, separate map files or deactivated maps.
es_es: <span class="fw-semibold">Opciones de mapa flexibles:</span> Elija entre mapas en línea, archivos de mapa independientes o mapas desactivados.
fr_fr: <span class="fw-semibold">Options de cartes flexibles:</span> Choisissez entre des cartes en ligne, des fichiers de cartes séparés ou des cartes désactivées.

source: <span class="fw-semibold">Simple configuration:</span> Intuitive settings for quick adjustments.
es_es: <span class="fw-semibold">Configuración sencilla:</span> Configuración intuitiva para ajustes rápidos.
fr_fr: <span class="fw-semibold">Configuration simple:</span> Paramètres intuitifs pour des ajustements rapides.

source: <span class="fw-semibold">Seamless integration:</span> Optimised for use in WordPress themes and plugins.
es_es: <span class="fw-semibold">Integración perfecta:</span> Optimizado para su uso en temas y plugins de WordPress.
fr_fr: <span class="fw-semibold">Intégration transparente:</span> Optimisé pour une utilisation dans les thèmes et les plugins WordPress.

source: <span class="fw-semibold">Efficient and reliable:</span> Reduces development effort through automated processes.
es_es: <span class="fw-semibold">Eficiente y fiable:</span> Reduce el esfuerzo de desarrollo mediante procesos automatizados.
fr_fr: <span class="fw-semibold">Efficace et fiable:</span> Réduit les efforts de développement grâce à des processus automatisés.

source: Advantages
es_es: Ventajas
fr_fr: Avantages

source: Save time with automatic SCSS-to-CSS compilation.
es_es: Ahorre tiempo con la compilación automática de SCSS a CSS.
fr_fr: Gagnez du temps grâce à la compilation automatique de SCSS en CSS.

source: Customise your workflow to suit your preferences.
es_es: Personalice su flujo de trabajo para adaptarlo a sus preferencias.
fr_fr: Personnalisez votre flux de travail en fonction de vos préférences.

source: Stay in control of your styles with clear debugging options.
es_es: Mantén el control de tus estilos con opciones de depuración claras.
fr_fr: Gardez le contrôle de vos styles grâce à des options de débogage claires.

source: AutoCSS Builder - Your helper for clean and optimised CSS code in WordPress. 🚀
es_es: AutoCSS Builder - Su ayudante para un código CSS limpio y optimizado en WordPress. 🚀

source: 🎉 Welcome to AutoCSS Builder!
es_es: 🎉 ¡Bienvenido a AutoCSS Builder!

source: Thank you for installing <span class="fw-semibold">AutoCSS Builder!</span> We look forward to supporting you in your WordPress development process. With this plugin, you can easily convert SCSS files to CSS and optimise your workflow.
es_es: Gracias por instalar <span class="fw-semibold">AutoCSS Builder</span> Esperamos poder ayudarle en su proceso de desarrollo de WordPress. Con este plugin, puede convertir fácilmente archivos SCSS a CSS y optimizar su flujo de trabajo.

source: First steps
es_es: Primeros pasos
fr_fr: Premiers pas

source: Configure settings
es_es: Configurar los ajustes
fr_fr: Configurer les paramètres

source: Add SCSS files
es_es: Añadir archivos SCSS

source: Test and enjoy
es_es: Probar y disfrutar
fr_fr: Testez et appréciez

source: Go to the plugin settings to specify paths to your SCSS and CSS files and select your preferred map option.
es_es: Vaya a la configuración del plugin para especificar las rutas a sus archivos SCSS y CSS y seleccione la opción de mapa que prefiera.
fr_fr: Allez dans les paramètres du plugin pour spécifier les chemins d'accès à vos fichiers SCSS et CSS et sélectionnez l'option de carte que vous préférez.

source: Upload your SCSS files to the corresponding directory. AutoCSS Builder will do the rest!
es_es: Cargue sus archivos SCSS en el directorio correspondiente. AutoCSS Builder hará el resto.

source: Change your SCSS files and view the automatically generated CSS files - it couldn't be quicker or easier.
es_es: Cambia tus archivos SCSS y visualiza los archivos CSS generados automáticamente: no podría ser más rápido y sencillo.
fr_fr: Modifiez vos fichiers SCSS et visualisez les fichiers CSS générés automatiquement - rien de plus rapide et de plus simple.

source: Useful functions
es_es: Funciones útiles
fr_fr: Fonctions utiles

source: <span class="fw-semibold">Live compilation:</span> Changes in SCSS files are applied directly to CSS.
es_es: <span class="fw-semibold">Compilación en vivo:</span> Los cambios en los archivos SCSS se aplican directamente a CSS.
fr_fr: <span class="fw-semibold">Compilation en direct:</span> Les modifications apportées aux fichiers SCSS sont appliquées directement aux feuilles de style CSS.

source: <span class="fw-semibold">Flexible map options:</span> Choose from inline maps, external maps or no maps at all.
es_es: <span class="fw-semibold">Opciones de mapas flexibles:</span> Elija entre mapas en línea, mapas externos o ningún mapa.
fr_fr: <span class="fw-semibold">Options de cartes flexibles:</span> Choisissez des cartes en ligne, des cartes externes ou pas de cartes du tout.

source: <span class="fw-semibold">WordPress integration:</span> Simple workflow, especially for WordPress themes and plugins.
es_es: <span class="fw-semibold">Integración con WordPress:</span> Flujo de trabajo sencillo, especialmente para temas y plugins de WordPress.
fr_fr: <span class="fw-semibold">Intégration de WordPress:</span> Flux de travail simple, en particulier pour les thèmes et les plugins WordPress.

source: 💖 Support the further development of AutoCSS Builder!
es_es: 💖 ¡Apoya el desarrollo futuro de AutoCSS Builder!

source: Thank you for using AutoCSS Builder! This plugin was developed to make your life as a developer easier - and it is constantly being improved. Your support helps us to develop new features, fix bugs and maintain the quality of the plugin.
es_es: ¡Gracias por usar AutoCSS Builder! Este plugin fue desarrollado para hacer su vida como desarrollador más fácil - y se está mejorando constantemente. Su apoyo nos ayuda a desarrollar nuevas características, corregir errores y mantener la calidad del plugin.

source: Why donate?
es_es: ¿Por qué donar?
fr_fr: Pourquoi faire un don ?

source: <span class="fw-semibold">Promotion of new features:</span> Your donation enables us to integrate even more helpful functions.
es_es: <span class="fw-semibold">Promoción de nuevas funciones:</span> Su donación nos permite integrar funciones aún más útiles.
fr_fr: <span class="fw-semibold">Promotion de nouvelles fonctionnalités:</span> Votre don nous permet d'intégrer des fonctions encore plus utiles.

source: <span class="fw-semibold">Continuous updates:</span> We ensure that the plugin remains compatible with future WordPress versions.
es_es: <span class="fw-semibold">Actualizaciones continuas:</span> Nos aseguramos de que el plugin siga siendo compatible con las futuras versiones de WordPress.
fr_fr: <span class="fw-semibold">Mises à jour continues:</span> Nous nous assurons que le plugin reste compatible avec les futures versions de WordPress.

source: <span class="fw-semibold">Community support:</span> With your support, we can respond more quickly to questions and problems.
es_es: <span class="fw-semibold">Apoyo de la comunidad:</span> Con su apoyo, podemos responder más rápidamente a preguntas y problemas.
fr_fr: <span class="fw-semibold">Soutien de la communauté:</span> Grâce à votre soutien, nous pouvons répondre plus rapidement aux questions et aux problèmes.

source: How can you help?
es_es: ¿Cómo puede ayudarnos?
fr_fr: Comment pouvez-vous nous aider ?

source: Every contribution - big or small - makes a difference!
es_es: Cada contribución -grande o pequeña- marca la diferencia.
fr_fr: Chaque contribution - petite ou grande - fait la différence !

source: Simply click on the button below to support us:
es_es: Simplemente haga clic en el botón de abajo para apoyarnos:
fr_fr: Il suffit de cliquer sur le bouton ci-dessous pour nous soutenir :

source: Thank you very much for your support!
es_es: Muchas gracias por su apoyo.
fr_fr: Merci beaucoup pour votre soutien !

source: Together we make AutoCSS Builder even better.
es_es: Juntos haremos que AutoCSS Builder sea aún mejor.

source: SCSS AutoCompiler is a powerful WordPress plugin that converts SCSS files to CSS - directly in your admin area. Choose between different map output options (inline, separate file, or no map) to customise your workflow. Ideal for developers who value efficiency and customisability.
fr_fr: SCSS AutoCompiler est un puissant plugin WordPress qui convertit les fichiers SCSS en CSS - directement dans votre zone d'administration. Choisissez parmi différentes options de sortie de carte (en ligne, fichier séparé, ou pas de carte) pour personnaliser votre flux de travail. Idéal pour les développeurs qui privilégient l'efficacité et la personnalisation.

source: Editor
fr_fr: Éditeur

source: Output
fr_fr: Sortie

source: SCSS AutoCompiler is the ideal tool for developers and designers who want to use SCSS in their WordPress projects. This plugin automatically converts SCSS files to CSS and offers flexible map output options, including inline maps, external files or no maps - depending on your needs.
fr_fr: SCSS AutoCompiler est l'outil idéal pour les développeurs et les designers qui souhaitent utiliser SCSS dans leurs projets WordPress. Ce plugin convertit automatiquement les fichiers SCSS en CSS et offre des options de sortie de carte flexibles, y compris des cartes en ligne, des fichiers externes ou aucune carte - en fonction de vos besoins.

source: SCSS AutoCompiler - Your helper for clean and optimised CSS code in WordPress. 🚀
fr_fr: SCSS AutoCompiler - Votre aide pour un code CSS propre et optimisé dans WordPress. 🚀

source: 🎉 Welcome to SCSS AutoCompiler!
fr_fr: 🎉 Bienvenue à SCSS AutoCompiler !

source: Thank you for installing <span class="fw-semibold">SCSS AutoCompiler!</span> We look forward to supporting you in your WordPress development process. With this plugin, you can easily convert SCSS files to CSS and optimise your workflow.
fr_fr: Merci d'avoir installé <span class="fw-semibold">SCSS AutoCompiler!</span> Nous sommes impatients de vous aider dans votre processus de développement WordPress. Avec ce plugin, vous pouvez facilement convertir les fichiers SCSS en CSS et optimiser votre flux de travail.

source: Upload your SCSS files to the corresponding directory. SCSS AutoCompiler will do the rest!
fr_fr: Téléchargez vos fichiers SCSS dans le répertoire correspondant. SCSS AutoCompiler fera le reste !

source: 💖 Support the further development of SCSS AutoCompiler!
fr_fr: 💖 Soutenir le développement de SCSS AutoCompiler !

source: Thank you for using SCSS AutoCompiler! This plugin was developed to make your life as a developer easier - and it is constantly being improved. Your support helps us to develop new features, fix bugs and maintain the quality of the plugin.
fr_fr: Merci d'utiliser SCSS AutoCompiler ! Ce plugin a été développé pour vous faciliter la vie en tant que développeur - et il est constamment amélioré. Votre soutien nous aide à développer de nouvelles fonctionnalités, à corriger les bugs et à maintenir la qualité du plugin.

source: Together we make SCSS AutoCompiler even better.
fr_fr: Ensemble, nous rendons SCSS AutoCompiler encore meilleur.

source: This plugin has been disabled because it requires a PHP version greater than %s and a WordPress version greater than %s. Your PHP version can be updated by your hosting provider.
fr_fr: Ce plugin a été désactivé car il nécessite une version PHP supérieure à %s et une version WordPress supérieure à %s. Votre version de PHP peut être mise à jour par votre hébergeur.
