Repository: team-hummelt/wp-sync-scss
Catalog: languages/scss-auto-compiler-*.po
Languages: de_de

source: Ajax transmission error
de_de: Ajax Übertragungsfehler

source: Cache cleared
de_de: Cache geleert

source: Settings
de_de: Einstellungen

source: Donate
de_de: Spenden

source: SCSS AutoCompiler is a powerful WordPress plugin that converts SCSS files to CSS - directly in your admin area. Choose between different map output options (inline, separate file, or no map) to customise your workflow. Ideal for developers who value efficiency and customisability.
de_de: SCSS AutoCompiler ist ein leistungsstarkes WordPress-Plugin, das SCSS-Dateien in CSS umwandelt – direkt in deinem Admin-Bereich. Wähle zwischen verschiedenen Map-Ausgabeoptionen (inline, separate Datei, oder keine Map), um deinen Workflow flexibel zu gestalten. Ideal für Entwickler, die Effizienz und Anpassungsfähigkeit schätzen.

source: Subscriber
de_de: Abonnent

source: Employees
de_de: Mitarbeiter

source: Author
de_de: Autor

source: Editor
de_de: Redakteur

source: Minimum requirement for using this plugin
de_de: Mindestvoraussetzung für die Verwendung dieses Plugins

source: Plugin settings
de_de: Plugin Einstellungen

source: Cache active
de_de: Cache aktiv

source: Set up paths
de_de: Pfade einrichten

source: SCSS Compiler active
de_de: SCSS Compiler aktiv

source: Select location
de_de: Location auswählen

source: SCSS compiler active
de_de: SCSS Compiler aktiv

source: Cache Setting
de_de: Cache Einstellung

source: Output settings
de_de: Ausgabe-Einstellungen

source: Create source map
de_de: Source Map erstellen

source: Create enqueue stylesheets
de_de: Enqueue Stylesheets erstellen

source: Compiler only active at login
de_de: Compiler nur bei Login aktiv

source: CSS stylesheets are automatically added to the header.
de_de: CSS-Stylesheets werden automatisch in den Header eingereiht.

source: If activated, the SCSS compiler is only active when a user is logged in.
de_de: Wenn aktiviert, ist der SCSS-Compiler nur aktiv, wenn ein Benutzer angemeldet ist.

source: Output
de_de: Ausgabe

source: Select folder
de_de: Location auswählen

source: Folder name
de_de: Ordnername

source: cancel
de_de: abbrechen

source: Cache path
de_de: Cache Pfad

source: Empty cache
de_de: Cache leeren

source: Plugin description
de_de: Plugin-Beschreibung

source: SCSS AutoCompiler is the ideal tool for developers and designers who want to use SCSS in their WordPress projects. This plugin automatically converts SCSS files to CSS and offers flexible map output options, including inline maps, external files or no maps - depending on your needs.
de_de: SCSS AutoCompiler ist das ideale Werkzeug für Entwickler und Designer, die SCSS in ihren WordPress-Projekten nutzen möchten. Dieses Plugin konvertiert SCSS-Dateien automatisch in CSS und bietet flexible Map-Ausgabeoptionen, darunter Inline-Maps, externe Dateien oder keine Maps – ganz nach deinen Bedürfnissen.

source: <span class="fw-semibold">Automatic SCSS compilation:</span> SCSS files are converted directly into CSS.
de_de: <span class="fw-semibold">Automatische SCSS-Kompilierung:</span> SCSS-Dateien werden direkt in CSS umgewandelt.

source: <span class="fw-semibold">Flexible map options:</span> Choose between inline maps, separate map files or deactivated maps.
de_de: <span class="fw-semibold">Flexible Map-Optionen:</span> Wähle zwischen Inline-Maps, separaten Map-Dateien oder deaktivierten Maps.

source: <span class="fw-semibold">Simple configuration:</span> Intuitive settings for quick adjustments.
de_de: <span class="fw-semibold">Einfache Konfiguration:</span> Intuitive Einstellungen für schnelle Anpassungen.

source: <span class="fw-semibold">Seamless integration:</span> Optimised for use in WordPress themes and plugins.
de_de: <span class="fw-semibold">Nahtlose Integration:</span> Optimiert für den Einsatz in WordPress-Themes und Plugins.

source: <span class="fw-semibold">Efficient and reliable:</span> Reduces development effort through automated processes.
de_de: <span class="fw-semibold">Effizient und zuverlässig:</span> Reduziert den Entwicklungsaufwand durch automatisierte Prozesse.

source: Advantages
de_de: Vorteile

source: Save time with automatic SCSS-to-CSS compilation.
de_de: Spare Zeit durch automatische SCSS-zu-CSS-Kompilierung.

source: Customise your workflow to suit your preferences.
de_de: Passe deinen Workflow an deine Präferenzen an.

source: Stay in control of your styles with clear debugging options.
de_de: Behalte die Kontrolle über deine Stile mit klaren Debugging-Optionen.

source: SCSS AutoCompiler - Your helper for clean and optimised CSS code in WordPress. 🚀
de_de: SCSS AutoCompiler – Dein Helfer für sauberen und optimierten CSS-Code in WordPress. 🚀

source: 🎉 Welcome to SCSS AutoCompiler!
de_de: 🎉 Willkommen bei SCSS AutoCompiler!

source: Thank you for installing <span class="fw-semibold">SCSS AutoCompiler!</span> We look forward to supporting you in your WordPress development process. With this plugin, you can easily convert SCSS files to CSS and optimise your workflow.
de_de: Vielen Dank, dass du <span class="fw-semibold">SCSS AutoCompiler</span> installiert hast! Wir freuen uns, dich bei deinem WordPress-Entwicklungsprozess unterstützen zu können. Mit diesem Plugin kannst du SCSS-Dateien mühelos in CSS umwandeln und deinen Workflow optimieren.

source: First steps
de_de: Erste Schritte

source: Configure settings
de_de: Einstellungen konfigurieren

source: Add SCSS files
de_de: SCSS-Dateien hinzufügen

source: Test and enjoy
de_de: Testen und genießen

source: Go to the plugin settings to specify paths to your SCSS and CSS files and select your preferred map option.
de_de: Gehe zu den Plugin-Einstellungen, um Pfade zu deinen SCSS- und CSS-Dateien anzugeben und deine bevorzugte Map-Option auszuwählen.

source: Upload your SCSS files to the corresponding directory. SCSS AutoCompiler will do the rest!
de_de: Lade deine SCSS-Dateien in das entsprechende Verzeichnis hoch. SCSS AutoCompiler erledigt den Rest!

source: Change your SCSS files and view the automatically generated CSS files - it couldn't be quicker or easier.
de_de: Ändere deine SCSS-Dateien und sieh dir die automatisch erstellten CSS-Dateien an – schneller und einfacher geht’s nicht.

source: Useful functions
de_de: Nützliche Funktionen

source: <span class="fw-semibold">Live compilation:</span> Changes in SCSS files are applied directly to CSS.
de_de: <span class="fw-semibold">Live-Kompilierung:</span> Änderungen in SCSS-Dateien werden direkt in CSS übernommen.

source: <span class="fw-semibold">Flexible map options:</span> Choose from inline maps, external maps or no maps at all.
de_de: <span class="fw-semibold">Flexible Map-Optionen:</span> Wähle aus Inline-Maps, externen Maps oder ganz ohne Maps.

source: <span class="fw-semibold">WordPress integration:</span> Simple workflow, especially for WordPress themes and plugins.
de_de: <span class="fw-semibold">WordPress-Integration:</span> Einfacher Workflow, speziell für WordPress-Themes und Plugins.

source: 💖 Support the further development of SCSS AutoCompiler!
de_de: 💖 Unterstütze die Weiterentwicklung von SCSS AutoCompiler!

source: Thank you for using SCSS AutoCompiler! This plugin was developed to make your life as a developer easier - and it is constantly being improved. Your support helps us to develop new features, fix bugs and maintain the quality of the plugin.
de_de: Vielen Dank, dass du SCSS AutoCompiler nutzt! Dieses Plugin wurde entwickelt, um dir das Leben als Entwickler zu erleichtern – und es wird ständig weiter verbessert. Deine Unterstützung hilft uns, neue Funktionen zu entwickeln, Bugs zu beheben und die Qualität des Plugins aufrechtzuerhalten.

source: Why donate?
de_de: Warum spenden?

source: <span class="fw-semibold">Promotion of new features:</span> Your donation enables us to integrate even more helpful functions.
de_de: <span class="fw-semibold">Förderung neuer Features:</span> Deine Spende ermöglicht es uns, noch mehr hilfreiche Funktionen zu integrieren.

source: <span class="fw-semibold">Continuous updates:</span> We ensure that the plugin remains compatible with future WordPress versions.
de_de: <span class="fw-semibold">Kontinuierliche Updates:</span> Wir sorgen dafür, dass das Plugin mit zukünftigen WordPress-Versionen kompatibel bleibt.

source: <span class="fw-semibold">Community support:</span> With your support, we can respond more quickly to questions and problems.
de_de: <span class="fw-semibold">Community-Support</span> Mit deiner Unterstützung können wir schneller auf Fragen und Probleme reagieren.

source: How can you help?
de_de: Wie kannst du helfen?

source: Every contribution - big or small - makes a difference!
de_de: Jeder Beitrag – ob groß oder klein – macht einen Unterschied!

source: Simply click on the button below to support us:
de_de: Klicke einfach auf den unten stehenden Button, um uns zu unterstützen:

source: Thank you very much for your support!
de_de: Vielen Dank für deine Unterstützung!

source: Together we make SCSS AutoCompiler even better.
de_de: Gemeinsam machen wir SCSS AutoCompiler noch besser.

source: This plugin has been disabled because it requires a PHP version greater than %s and a WordPress version greater than %s. Your PHP version can be updated by your hosting provider.
de_de: Dieses Plugin wurde deaktiviert, weil es eine PHP-Version größer als %s und eine WordPress-Version größer als %s benötigt. Ihre PHP-Version kann von Ihrem Hosting-Anbieter aktualisiert werden.
